stm32-hotspot/STM32WBA-BLE-HID-Keyboard/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_HID_Keyboard/STM32_WPAN/App/hids.c
          /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */

          /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
          break;/* ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
        }
        /* USER CODE BEGIN BLECORE_EVT */

        /* USER CODE END BLECORE_EVT */
        default:
          /* USER CODE BEGIN EVT_DEFAULT */

          /* USER CODE END EVT_DEFAULT */
          break;
      }
      /* USER CODE BEGIN EVT_VENDOR*/

      /* USER CODE END EVT_VENDOR*/
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT_CASES*/

      /* USER CODE END EVENT_PCKT_CASES*/

    default:
      /* USER CODE BEGIN EVENT_PCKT*/

      /* USER CODE END EVENT_PCKT*/
      break;
  }

  /* USER CODE BEGIN Service1_EventHandler_2 */

  /* USER CODE END Service1_EventHandler_2 */

  return(return_value);
}/* end HIDS_EventHandler */

/* Public functions ----------------------------------------------------------*/

/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void HIDS_Init(void)
{
  Char_UUID_t  uuid;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t max_attr_record;

  /* USER CODE BEGIN SVCCTL_InitService1Svc_1 */
  uint8_t buf[2] = {0,0};
  /* USER CODE END SVCCTL_InitService1Svc_1 */

  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterSvcHandler(HIDS_EventHandler);

  /**
   * HIDS
   *
   * Max_Attribute_Records = 1 + 2*6 + 1*no_of_char_with_notify_or_indicate_property + 1*no_of_char_with_broadcast_property
   * service_max_attribute_record = 1 for HIDS +
   *                                2 for INPUTREP +
   *                                2 for REM +
   *                                2 for HII +
   *                                2 for HCP +
   *                                2 for OUTPUTREP +
   *                                2 for FEATUREREP +
   *                                1 for INPUTREP configuration descriptor +
   *                              = 14
   * This value doesn't take into account number of descriptors manually added
   * In case of descriptors added, please update the max_attr_record value accordingly in the next SVCCTL_InitService User Section
   */
  max_attr_record = 14;

  /* USER CODE BEGIN SVCCTL_InitService */
  /* max_attr_record to be updated if descriptors have been added */
  /* Added 3 Report Reference characteristic descriptors */
  max_attr_record += 3;
  /* USER CODE END SVCCTL_InitService */

  uuid.Char_UUID_16 = 0x1812;
  ret = aci_gatt_add_service(UUID_TYPE_16,
                             (Service_UUID_t *) &uuid,
                             PRIMARY_SERVICE,
                             max_attr_record,
                             &(HIDS_Context.HidsSvcHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_service command: HIDS, error code: 0x%x \n\r", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_service command: HIDS \n\r");
  }

  /**
   * INPUTREP
   */
  uuid.Char_UUID_16 = 0x2a4d;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeInputrep,
                          CHAR_PROP_READ | CHAR_PROP_WRITE | CHAR_PROP_NOTIFY,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(HIDS_Context.InputrepCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : INPUTREP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : INPUTREP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char1 */
  /* Place holder for Characteristic Descriptors */
  /**
   * INPUTREP REF descriptor
   */
  uuid.Char_UUID_16 = 0x2908;
  buf[0] = 0;
  buf[1] = 1; /* Input Report */
  /* add the valid descriptor */
  ret = aci_gatt_add_char_desc(HIDS_Context.HidsSvcHdle, 
                               HIDS_Context.InputrepCharHdle, 
                               UUID_TYPE_16,
                               (Char_Desc_Uuid_t *)&uuid, 
                               SizeRepRefDesc,
                               SizeRepRefDesc,
                               (void *)&buf,
                               ATTR_PERMISSION_NONE,
                               ATTR_ACCESS_READ_ONLY,
                               GATT_DONT_NOTIFY_EVENTS,
                               0x10, 
                               CHAR_VALUE_LEN_CONSTANT,
                               &(HIDS_Context.InputRepRefDescHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gatt_add_char_desc command   : INPUT REP REF DESC, error code: 0x%2X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gatt_add_char_desc command   : INPUT REP REF DESC on handle 0x%x\n",
                HIDS_Context.InputRepRefDescHdle);
  }
  /* USER CODE END SVCCTL_InitService1Char1 */

  /**
   * REM
   */
  uuid.Char_UUID_16 = 0x2a4b;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeRem,
                          CHAR_PROP_READ,
                          ATTR_PERMISSION_ENCRY_READ,
                          GATT_DONT_NOTIFY_EVENTS,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(HIDS_Context.RemCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : REM, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : REM\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char2 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char2 */

  /**
   * HII
   */
  uuid.Char_UUID_16 = 0x2a4a;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeHii,
                          CHAR_PROP_READ,
                          ATTR_PERMISSION_NONE,
                          GATT_DONT_NOTIFY_EVENTS,
                          0x10,
                          CHAR_VALUE_LEN_CONSTANT,
                          &(HIDS_Context.HiiCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : HII, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : HII\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char3 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char3 */

  /**
   * HCP
   */
  uuid.Char_UUID_16 = 0x2a4c;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeHcp,
                          CHAR_PROP_WRITE_WITHOUT_RESP,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE,
                          0x10,
                          CHAR_VALUE_LEN_CONSTANT,
                          &(HIDS_Context.HcpCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : HCP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : HCP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char4 */
  /* Place holder for Characteristic Descriptors */

  /* USER CODE END SVCCTL_InitService1Char4 */

  /**
   * OUTPUTREP
   */
  uuid.Char_UUID_16 = 0x2a4d;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeOutputrep,
                          CHAR_PROP_READ | CHAR_PROP_WRITE_WITHOUT_RESP | CHAR_PROP_WRITE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(HIDS_Context.OutputrepCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : OUTPUTREP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : OUTPUTREP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char5 */
  /* Place holder for Characteristic Descriptors */
  /**
   * OUTPUTREP REF descriptor
   */
  uuid.Char_UUID_16 = 0x2908;
  buf[0] = 0;
  buf[1] = 2; /* Output Report */
  /* add the valid descriptor */
  ret = aci_gatt_add_char_desc(HIDS_Context.HidsSvcHdle, 
                               HIDS_Context.OutputrepCharHdle, 
                               UUID_TYPE_16,
                               (Char_Desc_Uuid_t *)&uuid, 
                               SizeRepRefDesc,
                               SizeRepRefDesc,
                               (void *)&buf,
                               ATTR_PERMISSION_NONE,
                               ATTR_ACCESS_READ_ONLY,
                               GATT_DONT_NOTIFY_EVENTS,
                               0x10, 
                               CHAR_VALUE_LEN_CONSTANT,
                               &(HIDS_Context.OutputRepRefDescHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gatt_add_char_desc command   : OUTPUT REP REF DESC, error code: 0x%2X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gatt_add_char_desc command   : OUTPUT REP REF DESC on handle 0x%x\n",
                HIDS_Context.OutputRepRefDescHdle);
  }
  /* USER CODE END SVCCTL_InitService1Char5 */

  /**
   * FEATUREREP
   */
  uuid.Char_UUID_16 = 0x2a4d;
  ret = aci_gatt_add_char(HIDS_Context.HidsSvcHdle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeFeaturerep,
                          CHAR_PROP_READ | CHAR_PROP_WRITE,
                          ATTR_PERMISSION_NONE,
                          GATT_NOTIFY_ATTRIBUTE_WRITE,
                          0x10,
                          CHAR_VALUE_LEN_VARIABLE,
                          &(HIDS_Context.FeaturerepCharHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : FEATUREREP, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : FEATUREREP\n");
  }

  /* USER CODE BEGIN SVCCTL_InitService1Char6 */
  /* Place holder for Characteristic Descriptors */
  /**
   * FEATUREREP REF descriptor
   */
  uuid.Char_UUID_16 = 0x2908;
  buf[0] = 0;
  buf[1] = 3; /* Output Report */
  /* add the valid descriptor */
  ret = aci_gatt_add_char_desc(HIDS_Context.HidsSvcHdle, 
                               HIDS_Context.FeaturerepCharHdle, 
                               UUID_TYPE_16,
                               (Char_Desc_Uuid_t *)&uuid, 
                               SizeRepRefDesc,
                               SizeRepRefDesc,
                               (void *)&buf,
                               ATTR_PERMISSION_NONE,
                               ATTR_ACCESS_READ_ONLY,
                               GATT_DONT_NOTIFY_EVENTS,
                               0x10, 
                               CHAR_VALUE_LEN_CONSTANT,
                               &(HIDS_Context.FeatureRepRefDescHdle));
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gatt_add_char_desc command   : FEATURE REP REF DESC, error code: 0x%2X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gatt_add_char_desc command   : FEATURE REP REF DESC on handle 0x%x\n",
                HIDS_Context.FeatureRepRefDescHdle);
  }
  /* USER CODE END SVCCTL_InitService1Char6 */

